In [1]:
## Project Part 1

In [2]:
import pandas as pd

In [3]:
## Load CSV File
titanic = pd.read_csv('https://vincentarelbundock.github.io/' + 'Rdatasets/csv/carData/TitanicSurvival.csv')

In [4]:
## Set Precision
pd.set_option('precision', 2)

In [5]:
## Rename Columns
titanic.columns = ['name', 'survived', 'sex', 'age', 'class']

In [6]:
## Basic Descriptive Statistics
titanic.describe()

           age
count  1046.00
mean     29.88
std      14.41
min       0.17
25%      21.00
50%      28.00
75%      39.00
max      80.00

In [7]:
## Statistics for those that survived
(titanic.survived == 'yes').describe()

count      1309
unique        2
top       False
freq        809
Name: survived, dtype: object

In [8]:
## Load matplotlib
%matplotlib

Using matplotlib backend: Qt5Agg

In [9]:
titanic

                                 name survived     sex    age class
0       Allen, Miss. Elisabeth Walton      yes  female  29.00   1st
1      Allison, Master. Hudson Trevor      yes    male   0.92   1st
2        Allison, Miss. Helen Loraine       no  female   2.00   1st
3     Allison, Mr. Hudson Joshua Crei       no    male  30.00   1st
4     Allison, Mrs. Hudson J C (Bessi       no  female  25.00   1st
...                               ...      ...     ...    ...   ...
1304             Zabour, Miss. Hileni       no  female  14.50   3rd
1305            Zabour, Miss. Thamine       no  female    NaN   3rd
1306        Zakarian, Mr. Mapriededer       no    male  26.50   3rd
1307              Zakarian, Mr. Ortin       no    male  27.00   3rd
1308               Zimmerman, Mr. Leo       no    male  29.00   3rd

[1309 rows x 5 columns]

In [20]:
## Create Histogram
histogram = titanic.hist()

In [21]:
## Brady Monks

In [22]:
## Project part 2

In [23]:
import sqlite3

In [24]:
connection = sqlite3.connect('books.db')

In [25]:
import pandas as pd

In [26]:
pd.options.display.max_columns = 10

In [27]:
pd.read_sql('select * from authors',connection,index_col=['id'])

DatabaseError: Execution failed on sql 'select * from authors': no such table: authors